[
  {
    "n": "ICC Mens T20 World Cup 2026",
    "c": "Sports",
    "no": 116,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/t20worldcup.webp",
    "vid": "https://tencentcdn11.tamashaweb.com/v1/019bf9b9eb3215fc600b35c80a5fba/019bffdc5fb61ea540a817848da787/TMSH_WEB2_CLEAN.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Exclusive coverage of ICC Men's T20 World Cup 2026. Watch all matches live with expert analysis and commentary. Experience the thrill of international cricket with high-quality streaming and real-time updates. The ultimate destination for cricket fans worldwide."
  },
  {
    "n": "Ten Sports",
    "c": "Sports",
    "no": 115,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/tensport.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/157-3H/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [
      {
        "label": "360p",
        "url": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/157-3L/playlist.m3u8"
      },
      {
        "label": "480p",
        "url": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/157-3M/playlist.m3u8"
      },
      {
        "label": "720p",
        "url": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/157-3H/playlist.m3u8"
      }
    ],
    "desc": "Premier sports broadcasting channel featuring live cricket, football, tennis, and other major sporting events. Enjoy comprehensive coverage of international tournaments with expert analysis. Your go-to destination for adrenaline-pumping sports action and exclusive interviews. Bringing you the best of global sports entertainment."
  },
  {
    "n": "PTV SPORTS",
    "c": "Sports",
    "no": 114,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ptvsports.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/189H/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [
      {
        "label": "SD",
        "url": "https://cdn07isb.tamashaweb.com:8087/YlUHeDQb7a/189M/playlist.m3u8"
      },
      {
        "label": "HD",
        "url": "https://cdn07isb.tamashaweb.com:8087/YlUHeDQb7a/189H/playlist.m3u8"
      }
    ],
    "desc": "Pakistan's premier sports channel broadcasting live cricket, hockey, football, and other national and international sports events. Get comprehensive coverage of domestic tournaments and international matches. Features expert analysis, player interviews, and behind-the-scenes access. Your ultimate source for sports entertainment."
  },
  {
    "n": "ARY News",
    "c": "News",
    "no": 113,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/arynews.webp",
    "vid": "https://cdn07isb.tamashaweb.com:8087/jazzauth/vsat-arynews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Leading 24/7 news channel providing comprehensive coverage of national and international news, current affairs, and breaking news. Stay informed with up-to-the-minute updates and in-depth analysis of important stories. Features exclusive interviews with newsmakers and political leaders. Your trusted source for accurate and timely news."
  },
  {
    "n": "Geo News",
    "c": "News",
    "no": 112,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/geonews.webp",
    "vid": "https://cdn07isb.tamashaweb.com:8087/jazzauth/vsat-geonews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Pakistan's most-watched news channel offering round-the-clock news coverage, current affairs programming, and special reports. Delivers breaking news with unmatched speed and accuracy across the nation. Features popular talk shows and investigative journalism segments. Connecting you to the stories that matter most."
  },
  {
    "n": "Madni Channel",
    "c": "Religious",
    "no": 111,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/madnitv.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/Madni-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Islamic educational channel dedicated to spreading the teachings of Islam through Quranic recitation, religious lectures, and Islamic programming. Features scholars explaining religious concepts and answering viewer questions. Provides spiritual guidance and promotes peace and understanding. A source of knowledge and enlightenment for all."
  },
  {
    "n": "Dawn News",
    "c": "News",
    "no": 110,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/dawnnews.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/DawnNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "English-language news channel from the Dawn Media Group providing comprehensive coverage of Pakistan and international news. Delivers balanced reporting with in-depth analysis of current events and political developments. Features interviews with opinion leaders and experts from various fields. Your window to informed and thoughtful journalism."
  },
  {
    "n": "Express News",
    "c": "News",
    "no": 109,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/expressnews.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/expressnews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "24/7 Urdu news channel providing breaking news, current affairs, and special reports from across Pakistan and the world. Keeps you updated with the latest developments in politics, business, and social issues. Features engaging talk shows and debates on important topics. Your companion for round-the-clock news coverage."
  },
  {
    "n": "Samaa News",
    "c": "News",
    "no": 108,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/samaatv.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/samaaTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Progressive news channel offering balanced and unbiased news coverage with a focus on social justice and human rights. Delivers comprehensive reporting on issues affecting ordinary citizens and marginalized communities. Features programs that give voice to the voiceless and highlight social concerns. Journalism with a conscience and commitment to truth."
  },
  {
    "n": "Aaj News",
    "c": "News",
    "no": 107,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aajnews.webp",
    "vid": "https://cdn05khi.tamashaweb.com:8087/jazzauth/AajNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "24-hour Urdu news channel known for its bold journalism and comprehensive news coverage. Brings you breaking news with accuracy and speed from all corners of the country. Features hard-hitting current affairs programs and political analysis. Your destination for fearless and independent journalism."
  },
  {
    "n": "24 News HD",
    "c": "News",
    "no": 106,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/24newshd.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/24News-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "High-definition news channel providing round-the-clock news coverage from Pakistan and around the world. Experience news like never before with crystal clear video quality and immersive reporting. Features exclusive interviews, special reports, and live coverage of major events. The future of news broadcasting in stunning HD."
  },
  {
    "n": "Hum TV",
    "c": "Entertainment",
    "no": 105,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/humtv.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/humTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Pakistan's leading entertainment channel featuring premium drama serials, talk shows, and entertainment programming. Captivates audiences with compelling storytelling and stellar performances by top artists. Offers a diverse range of content from romantic dramas to social issue-based series. Redefining entertainment with quality productions and creative excellence."
  },
  {
    "n": "ARY Digital",
    "c": "Entertainment",
    "no": 104,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/arydigital.webp",
    "vid": "https://cdn07lhr.tamashaweb.com:8087/jazzauth/vsat-arydigital-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Top-rated entertainment channel featuring drama serials, comedy shows, and family entertainment programming. Brings you the biggest stars and most popular shows on Pakistani television. Offers a perfect blend of traditional values and contemporary storytelling. Your ultimate destination for quality family entertainment."
  },
  {
    "n": "PTV Home",
    "c": "Entertainment",
    "no": 103,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ptvhome.webp",
    "vid": "https://cdn05khi.tamashaweb.com:8087/jazzauth/PTVHome-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Pakistan Television's flagship channel offering a mix of entertainment, information, and educational programming. Brings together generations with classic dramas, cultural shows, and national events coverage. Features programs that showcase Pakistan's rich heritage and traditions. The nation's favorite channel for over five decades."
  },
  {
    "n": "PTV World",
    "c": "News",
    "no": 102,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ptvworld.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/PTVWorld-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "English-language channel from Pakistan Television Corporation focusing on international affairs and Pakistan's perspective on global issues. Connects Pakistan with the world through comprehensive foreign policy coverage. Features discussions on geopolitics, trade, and cultural exchange programs. Your window to Pakistan's view on world events."
  },
  {
    "n": "PTV National",
    "c": "Entertainment",
    "no": 101,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ptvnational.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/PTVNational-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Urdu-language entertainment channel from PTV featuring drama, music, and cultural programming. Celebrates Pakistan's diverse cultures and languages through varied content. Brings regional programming from all provinces to promote national harmony. Your gateway to the cultural richness of Pakistan."
  },
  {
    "n": "Aljazeera",
    "c": "News",
    "no": 100,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aljazeera.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/AL-Jazeera-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "International news channel providing in-depth coverage of global events with a focus on the Middle East and developing world. Delivers award-winning journalism with perspectives often overlooked by Western media. Features documentaries, investigative reports, and exclusive interviews with world leaders. Your source for news from a different perspective."
  },
  {
    "n": "CNN",
    "c": "News",
    "no": 99,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/cnn.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/Livecnn-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Global news leader providing 24/7 coverage of breaking news, politics, business, technology, entertainment, and health. Connects you to the stories that shape our world with unmatched reporting and analysis. Features top anchors and correspondents from around the globe. The most trusted name in news for decades."
  },
  {
    "n": "Discovery HD",
    "c": "Documentary",
    "no": 98,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/discoverychnl.webp",
    "vid": "https://cdn05khi.tamashaweb.com:8087/jazzauth/DiscoveryHD-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "High-definition documentary channel featuring nature, science, technology, and adventure programming. Takes you on incredible journeys to explore the wonders of our world and beyond. Captivates with stunning visuals and groundbreaking stories of discovery and innovation. Satisfy your curiosity with the best factual entertainment."
  },
  {
    "n": "Animal Planet",
    "c": "Documentary",
    "no": 97,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/animalplanet.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/AnimalPlanet-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Dedicated to the animal kingdom, featuring wildlife documentaries, animal rescue shows, and conservation programming. Brings you closer to nature's most fascinating creatures and their habitats. Explores the relationship between humans and animals through heartwarming stories. Discover the wonders of the natural world and its inhabitants."
  },
  {
    "n": "BBC Earth",
    "c": "Documentary",
    "no": 96,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/bbcearth.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/BBC-Earth-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Nature and wildlife documentary channel from the BBC featuring breathtaking cinematography and scientific insight. Explores the planet's most extraordinary places and the creatures that inhabit them. Combines stunning visuals with compelling narratives about our natural world. Experience the beauty and wonder of life on Earth."
  },
  {
    "n": "Cartoon Network",
    "c": "Kids",
    "no": 95,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/cartoonnetwork.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/cartoonnetwork-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Kids entertainment channel featuring animated series, cartoons, and family-friendly programming. Brings beloved characters and exciting adventures to young audiences around the world. Offers a safe and fun environment for children to laugh, learn, and grow. Your child's favorite destination for endless entertainment."
  },
  {
    "n": "Baby TV",
    "c": "Kids",
    "no": 94,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/babytv.webp",
    "vid": "https://cdn05khi.tamashaweb.com:8087/jazzauth/BabyTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Specialized channel for infants and toddlers featuring gentle, educational programming designed for early childhood development. Stimulates young minds with colorful visuals and soothing melodies that encourage learning. Created with input from child development experts to ensure age-appropriate content. The perfect companion for your little one's early years."
  },
  {
    "n": "BBC CBeebies",
    "c": "Kids",
    "no": 93,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/cbeebies.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/BBC-Cbeebies-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "BBC's children's channel offering educational and entertaining programming for preschoolers. Helps little ones learn through play with trusted presenters and beloved characters. Features shows that encourage creativity, imagination, and social development. A safe and nurturing environment for your child's early years."
  },
  {
    "n": "Green Entertainment",
    "c": "Entertainment",
    "no": 92,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/greentv.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/Green_Entertainment-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "New entertainment channel focusing on fresh content, innovative programming, and contemporary storytelling. Brings together emerging talent and established stars for unique viewing experiences. Pushes creative boundaries with bold concepts and original productions. Redefining entertainment for modern audiences with fresh perspectives."
  },
  {
    "n": "Bol News",
    "c": "News",
    "no": 91,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/bolnews.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/BolNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "24-hour Urdu news channel providing comprehensive coverage of national and international news with a focus on current affairs. Delivers breaking news with speed and accuracy to keep you informed round the clock. Features talk shows that explore important issues affecting society and the nation. Your reliable source for news you can trust."
  },
  {
    "n": "Roze News",
    "c": "News",
    "no": 90,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/rozenews.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/RozNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Urdu news channel offering balanced news coverage, current affairs analysis, and special programming. Committed to presenting facts without bias and giving voice to all perspectives. Features programs that delve deep into political, social, and economic issues. Journalism that prioritizes truth and fairness above all else."
  },
  {
    "n": "Ary Zindagi",
    "c": "Entertainment",
    "no": 89,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aryzindgi.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/ARYzindagi-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel featuring drama serials, lifestyle programming, and family entertainment content. Celebrates life's beautiful moments with uplifting stories and feel-good programming. Offers a mix of entertainment that appeals to viewers of all ages and interests. Your daily dose of positivity and entertainment."
  },
  {
    "n": "Hum Masala",
    "c": "Entertainment",
    "no": 88,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/hummasla.webp",
    "vid": "https://cdn05khi.tamashaweb.com:8087/jazzauth/hummasala-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel focusing on lifestyle, food, fashion, and home improvement programming. Inspires viewers to live their best lives with practical tips and creative ideas. Features popular chefs, designers, and lifestyle experts sharing their knowledge and passion. Your guide to cooking, decorating, and living stylishly."
  },
  {
    "n": "Bol Entertainment",
    "c": "Entertainment",
    "no": 87,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/boltv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/BolEntertainment-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel offering drama serials, comedy shows, and family programming. Brings together talented actors and creative storytellers for engaging productions. Features content that resonates with Pakistani audiences while embracing modern themes. Your destination for quality entertainment the whole family can enjoy."
  },
  {
    "n": "Play TV",
    "c": "Entertainment",
    "no": 86,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/playent.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/play-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Youth-oriented entertainment channel featuring music, reality shows, and contemporary programming. Captures the energy and spirit of young Pakistan with vibrant and engaging content. Provides a platform for emerging talent and fresh perspectives on entertainment. Tune in for the latest trends in music, fashion, and youth culture."
  },
  {
    "n": "Aaj Entertainment",
    "c": "Entertainment",
    "no": 85,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aajent.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/AajEntertainment-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel from Aaj Media Group featuring drama, comedy, and family programming. Offers a diverse lineup of shows designed to entertain and engage viewers of all ages. Combines traditional storytelling with contemporary production values. Your source for fresh and exciting entertainment content."
  },
  {
    "n": "Euro Sports",
    "c": "Sports",
    "no": 84,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/eurosport.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/Eurosport-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "European sports channel covering football, tennis, cycling, motorsports, and other European sporting events. Brings you the excitement of top European leagues and tournaments live. Features expert commentary and analysis from former athletes and sports journalists. Your passport to the best of European sports action."
  },
  {
    "n": "Discover Pakistan",
    "c": "Travel",
    "no": 83,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/discoverypak.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/DiscoveryPakistan-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Travel and tourism channel dedicated to showcasing Pakistan's natural beauty, cultural heritage, and tourist destinations. Takes viewers on a journey through the country's breathtaking landscapes and historic sites. Highlights hidden gems and popular attractions for travelers and adventure seekers. Discover the beauty and diversity of Pakistan from your screen."
  },
  {
    "n": "Travel Channel",
    "c": "Travel",
    "no": 82,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/trvl.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/Travel-Channel-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Global travel channel featuring documentaries about destinations, cultures, and adventure travel around the world. Inspires wanderlust with breathtaking footage and stories from every corner of the globe. Offers practical travel tips, guides, and recommendations for your next adventure. Explore the world's most fascinating places without leaving home."
  },
  {
    "n": "BBC Lifestyle",
    "c": "Lifestyle",
    "no": 81,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/bbclifestyle.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/BBC-Lifestyle-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Lifestyle channel from BBC featuring programming on food, fashion, home, and wellbeing. Inspires viewers to enhance their daily lives with practical ideas and creative inspiration. Features experts sharing tips on cooking, decorating, health, and personal style. Your guide to living well and enjoying life to the fullest."
  },
  {
    "n": "BBC First",
    "c": "Entertainment",
    "no": 80,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/bbcfirst.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/BBC-First-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Premium entertainment channel from BBC featuring drama, comedy, and exclusive series. Brings you critically acclaimed productions and beloved British shows from the BBC archives. Features the finest storytelling, acting, and production values from the UK. Your first choice for exceptional entertainment from Britain."
  },
  {
    "n": "CGTN HD",
    "c": "News",
    "no": 79,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/cgtn.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/CgtnHD-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "China Global Television Network's high-definition English news channel providing China's perspective on global affairs. Offers comprehensive coverage of international events with a focus on Asia and developing nations. Features in-depth reporting on China's development and its relations with the world. Bridging cultures and connecting continents through news."
  },
  {
    "n": "CGTN Documentary",
    "c": "Documentary",
    "no": 78,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/cgtndoc.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/CgtnDocumentary-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Documentary channel from China Global Television Network featuring cultural, historical, and scientific programming. Explores the richness of Chinese civilization and its contributions to the world. Presents stories of innovation, tradition, and human achievement from across Asia. Discover the stories that shape our understanding of China and the world."
  },
  {
    "n": "Discovery Science",
    "c": "Documentary",
    "no": 77,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/discoveryscience.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/Discovery-Science-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Science-focused documentary channel exploring technology, engineering, space, and scientific discoveries. Makes complex concepts accessible and exciting for curious minds of all ages. Features groundbreaking research and the scientists pushing the boundaries of knowledge. Fuel your curiosity with the wonders of science and discovery."
  },
  {
    "n": "Discovery Turbo",
    "c": "Documentary",
    "no": 76,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/discoveryturbo.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/Discovery-Turbo-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Automotive and machinery channel featuring programs about cars, trucks, engineering, and extreme machines. Revs up your passion for all things mechanical with thrilling shows and expert insights. Takes you inside the world of custom builds, restorations, and automotive innovation. For gearheads and enthusiasts who love power and performance."
  },
  {
    "n": "ID",
    "c": "Documentary",
    "no": 75,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/id.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/Discovery-Investigation-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Investigation Discovery channel featuring true crime documentaries, mystery shows, and investigative programming. Delves into the psychology of criminals and the pursuit of justice by law enforcement. Tells compelling stories of real-life mysteries, forensic science, and courtroom drama. For viewers fascinated by the darker side of human nature."
  },
  {
    "n": "Public News",
    "c": "News",
    "no": 74,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/publicnews.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/PublicTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Public service news channel focusing on issues affecting ordinary citizens and community reporting. Gives voice to the voiceless and highlights stories often overlooked by mainstream media. Covers local news, civic issues, and grassroots movements with depth and sensitivity. Journalism that serves the public interest above all else."
  },
  {
    "n": "News One",
    "c": "News",
    "no": 73,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/newsone.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/NewsOne-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "24-hour Urdu news channel providing comprehensive news coverage and current affairs analysis. Keeps you informed about the latest developments in politics, business, and society. Features experienced journalists and analysts who provide context and perspective on complex issues. Your trusted source for news that matters."
  },
  {
    "n": "Khyber News",
    "c": "News",
    "no": 72,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/khybernews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/KhyberNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Regional news channel focusing on Khyber Pakhtunkhwa province and surrounding regions. Covers local politics, cultural events, and community issues with depth and sensitivity. Provides a platform for Pashtun voices and perspectives often absent from national media. Your connection to news and stories from the Khyber region."
  },
  {
    "n": "Neo News",
    "c": "News",
    "no": 71,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/neonews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/NeoNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Progressive news channel offering alternative perspectives and in-depth analysis of current affairs. Challenges conventional narratives and encourages critical thinking among viewers. Features independent journalists and thinkers who explore underreported stories. News with a fresh perspective for open-minded audiences."
  },
  {
    "n": "Such News",
    "c": "News",
    "no": 70,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/suchtv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/SachTV/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "News channel dedicated to factual reporting and verification of news stories. Combats misinformation and fake news through rigorous fact-checking and ethical journalism. Prioritizes accuracy over speed to ensure viewers receive reliable information. Your trusted source for verified news in an era of information chaos."
  },
  {
    "n": "KTN News",
    "c": "News",
    "no": 69,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ktnnews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/ktnNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Sindhi-language news channel providing coverage of national and regional news. Serves the Sindhi-speaking community with news that matters to their lives and culture. Features programs that highlight Sindh's rich heritage, politics, and social issues. Your window to news and perspectives from the land of Sufis."
  },
  {
    "n": "Channel 5 News",
    "c": "News",
    "no": 68,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/channel5.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Channel5-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "General news channel providing comprehensive coverage of current affairs and breaking news. Delivers balanced reporting on politics, business, sports, and entertainment. Features a team of experienced journalists dedicated to uncovering the truth. Your daily destination for news that informs and empowers."
  },
  {
    "n": "City 42",
    "c": "News",
    "no": 67,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/city42.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/city42(vnw)-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Local news channel focusing on Lahore and central Punjab region. Covers everything from city politics to cultural events and community news. Keeps residents informed about traffic, weather, and local issues affecting daily life. Your neighborhood connection to the pulse of Lahore and surrounding areas."
  },
  {
    "n": "Metro 1 News",
    "c": "News",
    "no": 66,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/metronews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Metro1News-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Metropolitan news channel focusing on urban issues and city developments. Covers the unique challenges and opportunities of life in Pakistan's major cities. Features stories about infrastructure, transportation, housing, and urban culture. Your guide to navigating and understanding metropolitan life."
  },
  {
    "n": "Sindh News",
    "c": "News",
    "no": 65,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/sindhnews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/SindhNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Sindhi-language news channel dedicated to Sindh province news and affairs. Covers politics, culture, development, and social issues across the province. Provides a platform for Sindhi voices and perspectives on regional and national matters. Stay connected to the land of the Indus and its vibrant communities."
  },
  {
    "n": "A1TV",
    "c": "Entertainment",
    "no": 64,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/a1tv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/A1TV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel featuring a variety of programming including drama, music, and lifestyle content. Offers something for everyone with a diverse lineup of shows and segments. Features emerging talent alongside established names in Pakistani entertainment. Your destination for fresh and engaging entertainment."
  },
  {
    "n": "Abn News",
    "c": "News",
    "no": 63,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/abnnews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/ABNnews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Regional news channel providing coverage of specific geographic areas and communities. Focuses on local news that national channels often overlook or underreport. Brings attention to issues affecting rural and semi-urban populations across Pakistan. Your connection to news from the grassroots level."
  },
  {
    "n": "Suno News",
    "c": "News",
    "no": 62,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/sunonews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Suno_News-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Urdu news channel with focus on audio-visual storytelling and engaging news presentation. Uses innovative formats to make news more accessible and understandable. Features young journalists bringing fresh energy and perspectives to news coverage. Listen up for news that speaks your language and captures your attention."
  },
  {
    "n": "TV One",
    "c": "Entertainment",
    "no": 61,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/tvone.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/TVOne-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "General entertainment channel featuring drama, comedy, and family programming. Brings together popular shows and beloved classics for viewers of all ages. Offers a mix of original productions and acquired content from around the world. Your one-stop destination for quality family entertainment."
  },
  {
    "n": "GTV News",
    "c": "News",
    "no": 60,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/gtvnews.webp",
    "vid": "https://cdn05khi.tamashaweb.com:8087/jazzauth/GTVNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "News channel with specific focus on certain demographic or interest group. Tailors content to meet the information needs of a particular audience segment. Delivers news that matters most to its viewers with depth and relevance. Specialized journalism for viewers who want more than general news."
  },
  {
    "n": "K21 News",
    "c": "News",
    "no": 59,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/k21.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/K21-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Specialized news channel focusing on specific sectors or industries. Provides in-depth coverage of business, technology, or other specialized areas. Features expert analysis and commentary from industry insiders and thought leaders. For viewers who need news beyond the headlines and into the details."
  },
  {
    "n": "365 News",
    "c": "News",
    "no": 58,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/365.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/365News-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Round-the-clock news channel providing continuous news updates and coverage. Keeps you informed every day of the year with non-stop news programming. Delivers breaking news as it happens with live coverage from around the world. Your constant companion for staying updated 365 days a year."
  },
  {
    "n": "Mehran TV",
    "c": "Entertainment",
    "no": 57,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/mehrantv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/MehranTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Sindhi-language entertainment channel featuring drama, music, and cultural programming. Celebrates the rich cultural heritage of Sindh through engaging entertainment content. Provides a platform for Sindhi artists, musicians, and performers to showcase their talent. Your window into the vibrant world of Sindhi entertainment and culture."
  },
  {
    "n": "Lahore Rang",
    "c": "Entertainment",
    "no": 56,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/lahorerang.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/LahoreRung-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Cultural entertainment channel focusing on Punjabi culture and Lahore's heritage. Brings the colors and flavors of Lahore's vibrant culture to your screen. Features music, food, festivals, and stories from the heart of Punjab. Celebrate the spirit of Lahore and Punjabi traditions with every program."
  },
  {
    "n": "Hum Sitaray",
    "c": "Entertainment",
    "no": 55,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/humsitaray.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/HumSitaray-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel featuring music-based programming and celebrity shows. Shines a spotlight on Pakistan's biggest stars and rising talents in entertainment. Offers exclusive interviews, behind-the-scenes content, and music countdowns. Your backstage pass to the world of Pakistani celebrities and showbiz."
  },
  {
    "n": "In Plus",
    "c": "Entertainment",
    "no": 54,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/inplus.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/Inplus-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Supplementary entertainment channel offering additional programming content. Complements main entertainment channels with extra shows and exclusive content. Provides more variety and choices for viewers seeking diverse entertainment options. Plus up your entertainment experience with this additional channel."
  },
  {
    "n": "LTN Family",
    "c": "Entertainment",
    "no": 53,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ltnfamily.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/LTNFamily-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Family-oriented entertainment channel with programming suitable for all ages. Brings the family together with wholesome content that parents and children can enjoy. Features shows that promote positive values and create shared viewing experiences. Quality time starts with quality entertainment for the whole family."
  },
  {
    "n": "Aur Life",
    "c": "Entertainment",
    "no": 52,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aurlifehd.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/AurLife-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Lifestyle and entertainment channel focusing on modern living and contemporary issues. Explores how Pakistanis live, work, and play in the 21st century. Features content about relationships, careers, health, and personal development. Your guide to navigating life's journey with style and purpose."
  },
  {
    "n": "Movie One",
    "c": "Entertainment",
    "no": 51,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/movieone.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/MovieOne-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Movie channel featuring film screenings, cinema news, and movie-related programming. Brings the magic of cinema to your screen with a diverse selection of films. Features everything from blockbuster hits to independent gems and classic favorites. Your front-row seat to the world of movies and filmmaking."
  },
  {
    "n": "Set Entertainment",
    "c": "Entertainment",
    "no": 50,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/setent.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/SetEntertainment-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "General entertainment channel with varied programming schedule. Offers a mix of drama, comedy, reality shows, and lifestyle content. Provides viewers with a wide range of choices for daily entertainment needs. Your set destination for diverse and engaging television content."
  },
  {
    "n": "Sab TV",
    "c": "Entertainment",
    "no": 49,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/subtv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/SabTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel known for comedy shows and light entertainment programming. Brings laughter and joy to viewers with hilarious sitcoms and comedy sketches. Features both classic comedy and fresh humor from emerging talents. Your daily dose of laughter and entertainment for the whole family."
  },
  {
    "n": "Aan TV",
    "c": "Entertainment",
    "no": 48,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aantv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/AAN-TV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Regional entertainment channel catering to specific linguistic or cultural group. Preserves and promotes regional languages through engaging entertainment content. Features programs that reflect the unique identity and traditions of its target audience. Come and explore the rich diversity of regional entertainment."
  },
  {
    "n": "Mini Max",
    "c": "Kids",
    "no": 47,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/minimax.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Minimax-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Children's channel featuring animated series and educational programming. Provides a safe and fun environment for kids to learn and play through television. Offers content that stimulates imagination and encourages positive values. Maximum fun and learning for your little ones in every show."
  },
  {
    "n": "ATV Khyber",
    "c": "Entertainment",
    "no": 46,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/khybertv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/AVTkhyberTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Pashto-language entertainment channel for Khyber Pakhtunkhwa audience. Celebrates Pashtun culture, music, and traditions through engaging programming. Provides a platform for Pashto artists and performers to reach their community. Your connection to entertainment that speaks your language and reflects your culture."
  },
  {
    "n": "City 41",
    "c": "News",
    "no": 45,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/city41.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/city41News-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Local news channel for specific city or metropolitan area. Keeps residents informed about local events, politics, and community issues. Covers everything from city council meetings to school events and neighborhood news. Your daily connection to what's happening in your city and your community."
  },
  {
    "n": "Mashriq TV",
    "c": "News",
    "no": 44,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/mashriqnews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/mashriqtv-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Urdu news channel with focus on eastern regions or specific geographic focus. Covers news and developments in the eastern parts of Pakistan with depth. Provides perspectives and stories from regions often underrepresented in national media. Illuminating the stories and voices from the East."
  },
  {
    "n": "Apna Channel",
    "c": "Entertainment",
    "no": 43,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/apnach.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Apna-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Community-focused entertainment channel for specific demographic group. Creates content that speaks directly to the experiences and interests of its audience. Builds community through shared stories, cultural programming, and local content. Your own channel, made for you and your community."
  },
  {
    "n": "DW",
    "c": "News",
    "no": 42,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/dw.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/DWNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Deutsche Welle's international news channel providing German perspective on global affairs. Delivers reliable news and in-depth analysis from Europe's largest economy. Features programming on politics, culture, and business with German thoroughness. Your window to Germany and European perspectives on world events."
  },
  {
    "n": "Kohinoor",
    "c": "Entertainment",
    "no": 41,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/kohinoortv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/KohinoorTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel featuring classic and vintage programming content. Takes viewers on a nostalgic journey through television's golden age and beloved classics. Preserves and celebrates the entertainment treasures of decades past. Rediscover the timeless shows that have shaped generations of viewers."
  },
  {
    "n": "Abbtakk",
    "c": "News",
    "no": 40,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/abbtakk.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/abbtak-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Urdu news channel known for breaking news alerts and fast news reporting. Lives up to its name by bringing you the latest news as it happens, until the end. Features a fast-paced format that keeps viewers updated throughout the day. For viewers who want their news fresh, fast, and non-stop."
  },
  {
    "n": "8XM",
    "c": "Music",
    "no": 39,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/8xm.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/8xm-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Music channel featuring non-stop music videos and music programming. Keeps the beat going 24/7 with the latest hits and timeless classics. Features a wide range of genres from pop and rock to traditional and fusion music. Turn up the volume and let the music play all day and night."
  },
  {
    "n": "KTN Entertainment",
    "c": "Entertainment",
    "no": 38,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ktntv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/ktnEntertainment-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Sindhi-language entertainment channel from KTN network. Brings the best of Sindhi entertainment to viewers across Pakistan and beyond. Features dramas, music shows, and cultural programs in the Sindhi language. Celebrating Sindhi culture and creativity through quality entertainment."
  },
  {
    "n": "Jalwa",
    "c": "Music",
    "no": 37,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/jalwatv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/jalwa-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Music and entertainment channel featuring glamour and showbiz programming. Brings the sparkle and excitement of the entertainment industry to your screen. Covers celebrity news, red carpet events, and the latest in fashion and style. Experience the glamour and dazzle of showbiz with every program."
  },
  {
    "n": "See TV",
    "c": "Entertainment",
    "no": 36,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/seetv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/seeTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Visual entertainment channel with focus on imagery and visual storytelling. Lets the pictures speak for themselves with visually stunning content. Features programs that emphasize cinematography, art, and visual expression. See the world through a different lens with this visually-oriented channel."
  },
  {
    "n": "Champion TV",
    "c": "Entertainment",
    "no": 35,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/championtv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/championtv-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel with focus on competition and achievement themes. Celebrates winners and champions across various fields of endeavor. Features stories of perseverance, success, and the pursuit of excellence. For viewers who believe in striving for greatness and achieving their dreams."
  },
  {
    "n": "Aruj TV",
    "c": "Entertainment",
    "no": 34,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/arujtv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Aruj-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Regional entertainment channel for specific area or community. Serves the entertainment needs of a particular geographic or cultural community. Features locally produced content that resonates with regional audiences. Rising to meet the entertainment needs of its dedicated viewers."
  },
  {
    "n": "Kay2",
    "c": "Entertainment",
    "no": 33,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/kay2.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Kay2-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Secondary entertainment channel from established media group. Expands viewing options with additional content and alternative programming. Offers viewers more choices from a trusted entertainment source. Double the entertainment with this companion channel to main offerings."
  },
  {
    "n": "A Plus",
    "c": "Entertainment",
    "no": 32,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aplus.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Aplus-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Premium entertainment channel with high-quality production values. Delivers an elevated viewing experience with superior content and presentation. Features carefully curated programs that meet the highest standards of entertainment. Adding value and quality to your entertainment choices."
  },
  {
    "n": "Hum Pashto 1",
    "c": "Entertainment",
    "no": 31,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/pashto1.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Pashto1-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Pashto-language entertainment channel from Hum network. Brings the Hum network's production quality to Pashto-speaking audiences. Features dramas, music, and cultural programs in the Pashto language. Connecting Pashtun viewers to quality entertainment that speaks their language."
  },
  {
    "n": "Aik News",
    "c": "News",
    "no": 30,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/aiknews.webp",
    "vid": "https://cdn21lhr.tamashaweb.com:8087/jazzauth/PNN-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Unified news channel presenting consolidated news coverage. Brings together news from various sources into one comprehensive broadcast. Simplifies news consumption by providing a complete picture in one place. One channel, complete news coverage for your convenience."
  },
  {
    "n": "Waseb TV",
    "c": "Entertainment",
    "no": 29,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/wasebtv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/waseeb-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Regional entertainment channel for specific geographic territory. Serves the entertainment needs of a defined region with locally relevant content. Features programming that reflects the culture and interests of its target area. Homegrown entertainment for viewers in its broadcast territory."
  },
  {
    "n": "Saudi Quran",
    "c": "Religious",
    "no": 28,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/alquran.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Saudimakkah(nw)-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Islamic religious channel from Saudi Arabia focusing on Quranic studies. Broadcasts Quran recitations, explanations, and related programming from the holy land. Features renowned reciters and scholars sharing knowledge of the holy book. Connect with the divine word through this dedicated Quran channel."
  },
  {
    "n": "Saudi Sunnah",
    "c": "Religious",
    "no": 27,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/saudisunnah.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/SaudiSunnah(NW)-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Islamic channel focusing on teachings of Prophet Muhammad (PBUH). Shares knowledge about the Prophet's life, traditions, and teachings with viewers. Features scholars explaining Hadith and their application in daily life. Learn and understand the Sunnah through authentic and insightful programming."
  },
  {
    "n": "BBC News",
    "c": "News",
    "no": 26,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/bbcnews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/BBCNEWS-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "BBC's global news channel providing trusted international news coverage. Delivers impartial journalism and in-depth reporting from around the world. Features the BBC's renowned correspondents and analysis of global events. The world's most trusted international news broadcaster, now on your screen."
  },
  {
    "n": "Paigham TV",
    "c": "Religious",
    "no": 25,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/paighamtv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/PaighamTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Islamic educational channel focusing on spiritual development and moral guidance. Delivers messages of peace, understanding, and faith to viewers of all ages. Features scholars discussing Islamic teachings and their relevance to modern life. Spreading the message of Islam through education and enlightenment."
  },
  {
    "n": "Rohi News",
    "c": "News",
    "no": 24,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/rohinews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/RohiTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Regional news channel focusing on rural and agricultural issues. Covers the news that matters to farming communities and rural populations. Features stories about agriculture, rural development, and village life. Giving voice to the heartland and its contribution to the nation."
  },
  {
    "n": "Sun News HD",
    "c": "News",
    "no": 23,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/sunnews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Suno_News-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "High-definition news channel with focus on visual quality and production. Delivers news in stunning HD with crisp visuals and superior production values. Enhances the news viewing experience with professional presentation and technical excellence. See the news in a new light with crystal clear HD quality."
  },
  {
    "n": "Digital Pakistan Dispatch",
    "c": "News",
    "no": 22,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/digitalpak.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/Digital-pak-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "News channel focusing on technology, digital innovation, and IT sector news. Covers Pakistan's growing tech industry and digital transformation journey. Features stories about startups, innovation, and the digital economy. Your source for news at the intersection of Pakistan and technology."
  },
  {
    "n": "Tamasha News",
    "c": "News",
    "no": 21,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/tamashanews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/Tamasha-News-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "News channel from Tamasha network with unique presentation style. Brings a fresh approach to news broadcasting with engaging formats. Features young anchors and innovative storytelling techniques. News presented with flair and energy for modern audiences."
  },
  {
    "n": "Tamasha Life HD",
    "c": "Lifestyle",
    "no": 20,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/tamashalifehd.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/Tamasha-Life-HD-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "High-definition lifestyle channel from Tamasha network. Explores modern living, trends, and lifestyle choices in stunning HD. Features content about fashion, food, travel, and contemporary culture. Live your best life with inspiration and ideas from this lifestyle destination."
  },
  {
    "n": "Tamasha Women",
    "c": "Lifestyle",
    "no": 19,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/tamashawoman.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/Tamasha-Women-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Women-focused lifestyle channel addressing female audience interests. Creates content that speaks to women's experiences, challenges, and aspirations. Features programs on health, relationships, career, and personal development. Celebrating women's lives and providing content that matters to them."
  },
  {
    "n": "PTV News",
    "c": "News",
    "no": 18,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ptvnews.webp",
    "vid": "https://cdn23lhr.tamashaweb.com:8087/jazzauth/PTVNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Official news channel of Pakistan Television Corporation. Delivers authoritative news coverage with the credibility of the national broadcaster. Features comprehensive reporting on national affairs and government activities. Your trusted source for news from Pakistan's official television network."
  },
  {
    "n": "Kashish News",
    "c": "News",
    "no": 17,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/kashish.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/KashishTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "News channel with focus on cultural and soft news programming. Attracts viewers with stories that appeal to emotions and cultural interests. Features positive news, human interest stories, and cultural coverage. News with heart that draws you in with compelling storytelling."
  },
  {
    "n": "GNN",
    "c": "News",
    "no": 16,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/gnn.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/GNN-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Global News Network providing international news coverage. Connects Pakistani viewers to events and developments around the world. Features reporting from major global news centers and correspondents abroad. Your window to international news with a Pakistani perspective."
  },
  {
    "n": "Geo Harpal",
    "c": "Entertainment",
    "no": 15,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/geoharpal.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/GeoHarpal-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel from Geo network with varied programming. Offers a mix of content to entertain viewers at every moment of the day. Features shows that range from drama to comedy to lifestyle programming. Every moment is entertainment with this diverse channel from Geo."
  },
  {
    "n": "Time News",
    "c": "News",
    "no": 14,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/timenews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/TimeNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "News channel focusing on timely and chronological news coverage. Presents news in a way that helps viewers understand the sequence of events. Features timelines and contextual reporting that explains how stories develop. Stay on time with news that respects the importance of timing and context."
  },
  {
    "n": "Sindh TV",
    "c": "Entertainment",
    "no": 13,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/Sindhtv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/sindhTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Sindhi-language entertainment channel promoting Sindhi culture. Celebrates the language, music, and traditions of Sindh through engaging content. Features dramas, musical programs, and cultural shows in Sindhi. Your destination for entertainment that speaks the language of Sindh."
  },
  {
    "n": "Express Entertainment",
    "c": "Entertainment",
    "no": 12,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/expressent.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/ExpressEntertainment-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Entertainment channel from Express Media Group. Delivers quality entertainment programming with the Express group's production values. Features dramas, comedy shows, and lifestyle content for diverse audiences. Express yourself through entertainment with this dynamic channel."
  },
  {
    "n": "C21 News",
    "c": "News",
    "no": 11,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/city21.webp",
    "vid": "https://cdn22lhr.tamashaweb.com:8087/jazzauth/city21-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "21st century news channel with modern approach to news broadcasting. Embraces contemporary formats and digital-age presentation styles. Features young journalists and innovative storytelling techniques. News for the modern viewer in the 21st century."
  },
  {
    "n": "Hum News",
    "c": "News",
    "no": 10,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/humnews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/humnews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "News channel from Hum network with entertainment-style news presentation. Brings the Hum network's production quality to news broadcasting. Features engaging formats and visual storytelling in news coverage. News presented with the creativity and style you expect from Hum."
  },
  {
    "n": "BBC Brit",
    "c": "News",
    "no": 9,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/bbcbrit.webp",
    "vid": "https://cdn05khi.tamashaweb.com:8087/jazzauth/BBC-Brit-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "BBC channel focusing on British culture, comedy, and entertainment. Brings the best of British programming to international audiences. Features beloved comedies, entertainment shows, and cultural content from the UK. Experience the wit, charm, and creativity of British television."
  },
  {
    "n": "Afghan TV",
    "c": "Entertainment",
    "no": 8,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/afghantv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/AfghanTV-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Afghan entertainment channel featuring Afghan culture and programming. Serves the Afghan community with content that reflects their heritage. Features music, dramas, and cultural shows from and about Afghanistan. Connecting Afghans at home and abroad through shared entertainment."
  },
  {
    "n": "Dunya News",
    "c": "News",
    "no": 7,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/dunyanews.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/DunyaNews-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Major Urdu news channel providing comprehensive news coverage. Delivers the world of news to viewers in Urdu with depth and accuracy. Features a wide range of programs covering politics, business, and current affairs. Your window to the world, explained in your language."
  },
  {
    "n": "Capital TV",
    "c": "News",
    "no": 6,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/capitaltv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/111M/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [
      {
        "label": "SD",
        "url": "https://cdn12isb.tamashaweb.com:8087/jazzauth/111L/playlist.m3u8"
      },
      {
        "label": "HD",
        "url": "https://cdn12isb.tamashaweb.com:8087/jazzauth/111M/playlist.m3u8"
      }
    ],
    "desc": "News channel focusing on capital city and national affairs. Covers the political heartbeat of the nation from Islamabad and beyond. Features reporting on government, parliament, and policy developments. Your connection to the center of power and national decision-making."
  },
  {
    "n": "Awaz TV",
    "c": "News",
    "no": 5,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/awaztv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/120M/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
     "manualQualities": [
      {
        "label": "SD",
        "url": "https://cdn12isb.tamashaweb.com:8087/jazzauth/120L/playlist.m3u8"
      },
      {
        "label": "HD",
        "url": "https://cdn12isb.tamashaweb.com:8087/jazzauth/120M/playlist.m3u8"
      }
    ],
    "desc": "Voice-focused news channel emphasizing opinion and commentary. Gives voice to diverse perspectives on current events and social issues. Features talk shows and discussion programs that encourage public debate. Hear the voices that shape public opinion and discourse."
  },
  {
    "n": "ATV",
    "c": "Entertainment",
    "no": 4,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/atv.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/jazzauth/123M/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [
      {
        "label": "SD",
        "url": "https://cdn12isb.tamashaweb.com:8087/jazzauth/123L/playlist.m3u8"
      },
      {
        "label": "HD",
        "url": "https://cdn12isb.tamashaweb.com:8087/jazzauth/123M/playlist.m3u8"
      }
    ],
    "desc": "General entertainment channel with broad audience appeal. Offers a mix of programming designed to entertain viewers of all ages. Features dramas, comedy shows, and family-oriented content. Your all-purpose entertainment destination for daily viewing pleasure."
  },
  {
    "n": "TRT World",
    "c": "News",
    "no": 3,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/trtworld.webp",
    "vid": "https://cdn07isb.tamashaweb.com:8087/YlUHeDQb7a/153M/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [
      {
        "label": "SD",
        "url": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/153L/playlist.m3u8"
      },
      {
        "label": "HD",
        "url": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/153M/playlist.m3u8"
      }
    ],
    "desc": "Turkish international news channel providing global news coverage. Offers a Turkish perspective on international affairs and global events. Features in-depth reporting from correspondents around the world. See the world through the eyes of Turkey's international broadcaster."
  },
  {
    "n": "Filmax",
    "c": "Movies",
    "no": 2,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/filmax.webp",
    "vid": "https://cdn12isb.tamashaweb.com:8087/YlUHeDQb7a/Filmax-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Movie channel featuring international film screenings. Brings the best of world cinema to viewers with diverse film selections. Features everything from Hollywood blockbusters to independent and art house films. Maximize your movie experience with films from around the globe."
  },
  {
    "n": "Jazba Cinema",
    "c": "Movies",
    "no": 1,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/JazbaCinemaHD.webp",
    "vid": "https://cdn02lhr.tamashaweb.com:8087/jazzauth/177H/chunks.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [
      {
        "label": "SD",
        "url": "https://cdn02lhr.tamashaweb.com:8087/jazzauth/177M/chunks.m3u8"
      },
      {
        "label": "HD",
        "url": "https://cdn02lhr.tamashaweb.com:8087/jazzauth/177H/chunks.m3u8"
      }
    ],
    "desc": "High-definition movie channel featuring Pakistani and international films. Captures the passion and emotion of cinema with stunning HD quality. Features a carefully curated selection of films for discerning movie lovers. Experience the passion of cinema with every film screened on this channel."
  },
  {
    "n": "PTV Bolan",
    "c": "Entertainment",
    "no": 0,
    "img": "https://file.garden/aWfBGfhwaGcNwkre/ptvbolan.webp",
    "vid": "https://cdn24lhr.tamashaweb.com:8087/jazzauth/PTVBolan-abr/playlist.m3u8",
    "vid2": "",
    "live": true,
    "quality": ["auto"],
    "manualQualities": [],
    "desc": "Urdu-language entertainment channel from PTV featuring drama, music, and cultural programming. Serves the entertainment needs of Balochistan and beyond with diverse content. Features programs that reflect the unique culture and traditions of the region. Connecting Balochistan to the nation through quality entertainment."
  }
]
